Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128GM710.h
#define _C1RXM1EID_EID3_POSITION                 0x00000003
#define _C1RXM1EID_EID3_MASK                     0x00000008
#define _C1RXM1EID_EID3_LENGTH                   0x00000001

#define _C1RXM1EID_EID4_POSITION                 0x00000004
#define _C1RXM1EID_EID4_MASK                     0x00000010
#define _C1RXM1EID_EID4_LENGTH                   0x00000001

#define _C1RXM1EID_EID5_POSITION                 0x00000005
#define _C1RXM1EID_EID5_MASK                     0x00000020
#define _C1RXM1EID_EID5_LENGTH                   0x00000001

#define _C1RXM1EID_EID6_POSITION                 0x00000006
#define _C1RXM1EID_EID6_MASK                     0x00000040
#define _C1RXM1EID_EID6_LENGTH                   0x00000001

#define _C1RXM1EID_EID7_POSITION                 0x00000007
#define _C1RXM1EID_EID7_MASK                     0x00000080
#define _C1RXM1EID_EID7_LENGTH                   0x00000001

#define _C1RXM1EID_EID8_POSITION                 0x00000008
#define _C1RXM1EID_EID8_MASK                     0x00000100
#define _C1RXM1EID_EID8_LENGTH                   0x00000001

#define _C1RXM1EID_EID9_POSITION                 0x00000009
#define _C1RXM1EID_EID9_MASK                     0x00000200
#define _C1RXM1EID_EID9_LENGTH                   0x00000001

#define _C1RXM1EID_EID10_POSITION                0x0000000A
#define _C1RXM1EID_EID10_MASK                    0x00000400
#define _C1RXM1EID_EID10_LENGTH                  0x00000001

#define _C1RXM1EID_EID11_POSITION                0x0000000B
#define _C1RXM1EID_EID11_MASK                    0x00000800
#define _C1RXM1EID_EID11_LENGTH                  0x00000001

#define _C1RXM1EID_EID12_POSITION                0x0000000C
#define _C1RXM1EID_EID12_MASK                    0x00001000
#define _C1RXM1EID_EID12_LENGTH                  0x00000001

#define _C1RXM1EID_EID13_POSITION                0x0000000D
#define _C1RXM1EID_EID13_MASK                    0x00002000
#define _C1RXM1EID_EID13_LENGTH                  0x00000001

#define _C1RXM1EID_EID14_POSITION                0x0000000E
#define _C1RXM1EID_EID14_MASK                    0x00004000
#define _C1RXM1EID_EID14_LENGTH                  0x00000001

#define _C1RXM1EID_EID15_POSITION                0x0000000F
#define _C1RXM1EID_EID15_MASK                    0x00008000
#define _C1RXM1EID_EID15_LENGTH                  0x00000001

#define _C1RXM1EID_EID_POSITION                  0x00000000
#define _C1RXM1EID_EID_MASK                      0x0000FFFF
#define _C1RXM1EID_EID_LENGTH                    0x00000010

#define _C1TR67CON_TX6PRI_POSITION               0x00000000
#define _C1TR67CON_TX6PRI_MASK                   0x00000003
#define _C1TR67CON_TX6PRI_LENGTH                 0x00000002

#define _C1TR67CON_RTREN6_POSITION               0x00000002
#define _C1TR67CON_RTREN6_MASK                   0x00000004
#define _C1TR67CON_RTREN6_LENGTH                 0x00000001

#define _C1TR67CON_TXREQ6_POSITION               0x00000003
#define _C1TR67CON_TXREQ6_MASK                   0x00000008
#define _C1TR67CON_TXREQ6_LENGTH                 0x00000001

#define _C1TR67CON_TXERR6_POSITION               0x00000004
#define _C1TR67CON_TXERR6_MASK                   0x00000010
#define _C1TR67CON_TXERR6_LENGTH                 0x00000001

#define _C1TR67CON_TXLARB6_POSITION              0x00000005
#define _C1TR67CON_TXLARB6_MASK                  0x00000020
#define _C1TR67CON_TXLARB6_LENGTH                0x00000001

#define _C1TR67CON_TXABT6_POSITION               0x00000006
#define _C1TR67CON_TXABT6_MASK                   0x00000040
#define _C1TR67CON_TXABT6_LENGTH                 0x00000001

#define _C1TR67CON_TXEN6_POSITION                0x00000007
#define _C1TR67CON_TXEN6_MASK                    0x00000080
#define _C1TR67CON_TXEN6_LENGTH                  0x00000001

#define _C1TR67CON_TX7PRI_POSITION               0x00000008
#define _C1TR67CON_TX7PRI_MASK                   0x00000300
#define _C1TR67CON_TX7PRI_LENGTH                 0x00000002

#define _C1TR67CON_RTREN7_POSITION               0x0000000A
#define _C1TR67CON_RTREN7_MASK                   0x00000400
#define _C1TR67CON_RTREN7_LENGTH                 0x00000001

#define _C1TR67CON_TXREQ7_POSITION               0x0000000B
#define _C1TR67CON_TXREQ7_MASK                   0x00000800
#define _C1TR67CON_TXREQ7_LENGTH                 0x00000001

#define _C1TR67CON_TXERR7_POSITION               0x0000000C
#define _C1TR67CON_TXERR7_MASK                   0x00001000
#define _C1TR67CON_TXERR7_LENGTH                 0x00000001

#define _C1TR67CON_TXLARB7_POSITION              0x0000000D
#define _C1TR67CON_TXLARB7_MASK                  0x00002000
#define _C1TR67CON_TXLARB7_LENGTH                0x00000001

#define _C1TR67CON_TXABT7_POSITION               0x0000000E
#define _C1TR67CON_TXABT7_MASK                   0x00004000
#define _C1TR67CON_TXABT7_LENGTH                 0x00000001

#define _C1TR67CON_TXEN7_POSITION                0x0000000F
#define _C1TR67CON_TXEN7_MASK                    0x00008000
#define _C1TR67CON_TXEN7_LENGTH                  0x00000001

#define _C1TR67CON_TX6PRI0_POSITION              0x00000000
#define _C1TR67CON_TX6PRI0_MASK                  0x00000001
#define _C1TR67CON_TX6PRI0_LENGTH                0x00000001

#define _C1TR67CON_TX6PRI1_POSITION              0x00000001
#define _C1TR67CON_TX6PRI1_MASK                  0x00000002
#define _C1TR67CON_TX6PRI1_LENGTH                0x00000001

#define _C1TR67CON_TX7PRI0_POSITION              0x00000008
#define _C1TR67CON_TX7PRI0_MASK                  0x00000100
#define _C1TR67CON_TX7PRI0_LENGTH                0x00000001

#define _C1TR67CON_TX7PRI1_POSITION              0x00000009
#define _C1TR67CON_TX7PRI1_MASK                  0x00000200
#define _C1TR67CON_TX7PRI1_LENGTH                0x00000001

#define _C1RXM2SID_EID16_POSITION                0x00000000
#define _C1RXM2SID_EID16_MASK                    0x00000001
#define _C1RXM2SID_EID16_LENGTH                  0x00000001

#define _C1RXM2SID_EID17_POSITION                0x00000001
#define _C1RXM2SID_EID17_MASK                    0x00000002
#define _C1RXM2SID_EID17_LENGTH                  0x00000001

#define _C1RXM2SID_MIDE_POSITION                 0x00000003
#define _C1RXM2SID_MIDE_MASK                     0x00000008
#define _C1RXM2SID_MIDE_LENGTH                   0x00000001

#define _C1RXM2SID_SID0_POSITION                 0x00000005
#define _C1RXM2SID_SID0_MASK                     0x00000020
#define _C1RXM2SID_SID0_LENGTH                   0x00000001

