Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP128GM710.h
#define _CNPDE_CNPDE13_POSITION                  0x0000000D
#define _CNPDE_CNPDE13_MASK                      0x00002000
#define _CNPDE_CNPDE13_LENGTH                    0x00000001

#define _CNPDE_CNPDE14_POSITION                  0x0000000E
#define _CNPDE_CNPDE14_MASK                      0x00004000
#define _CNPDE_CNPDE14_LENGTH                    0x00000001

#define _CNPDE_CNPDE15_POSITION                  0x0000000F
#define _CNPDE_CNPDE15_MASK                      0x00008000
#define _CNPDE_CNPDE15_LENGTH                    0x00000001

#define _ANSELE_ANSE0_POSITION                   0x00000000
#define _ANSELE_ANSE0_MASK                       0x00000001
#define _ANSELE_ANSE0_LENGTH                     0x00000001

#define _ANSELE_ANSE1_POSITION                   0x00000001
#define _ANSELE_ANSE1_MASK                       0x00000002
#define _ANSELE_ANSE1_LENGTH                     0x00000001

#define _ANSELE_ANSE8_POSITION                   0x00000008
#define _ANSELE_ANSE8_MASK                       0x00000100
#define _ANSELE_ANSE8_LENGTH                     0x00000001

#define _ANSELE_ANSE9_POSITION                   0x00000009
#define _ANSELE_ANSE9_MASK                       0x00000200
#define _ANSELE_ANSE9_LENGTH                     0x00000001

#define _ANSELE_ANSE12_POSITION                  0x0000000C
#define _ANSELE_ANSE12_MASK                      0x00001000
#define _ANSELE_ANSE12_LENGTH                    0x00000001

#define _ANSELE_ANSE13_POSITION                  0x0000000D
#define _ANSELE_ANSE13_MASK                      0x00002000
#define _ANSELE_ANSE13_LENGTH                    0x00000001

#define _ANSELE_ANSE14_POSITION                  0x0000000E
#define _ANSELE_ANSE14_MASK                      0x00004000
#define _ANSELE_ANSE14_LENGTH                    0x00000001

#define _ANSELE_ANSE15_POSITION                  0x0000000F
#define _ANSELE_ANSE15_MASK                      0x00008000
#define _ANSELE_ANSE15_LENGTH                    0x00000001

#define _TRISF_TRISF0_POSITION                   0x00000000
#define _TRISF_TRISF0_MASK                       0x00000001
#define _TRISF_TRISF0_LENGTH                     0x00000001

#define _TRISF_TRISF1_POSITION                   0x00000001
#define _TRISF_TRISF1_MASK                       0x00000002
#define _TRISF_TRISF1_LENGTH                     0x00000001

#define _TRISF_TRISF4_POSITION                   0x00000004
#define _TRISF_TRISF4_MASK                       0x00000010
#define _TRISF_TRISF4_LENGTH                     0x00000001

#define _TRISF_TRISF5_POSITION                   0x00000005
#define _TRISF_TRISF5_MASK                       0x00000020
#define _TRISF_TRISF5_LENGTH                     0x00000001

#define _TRISF_TRISF6_POSITION                   0x00000006
#define _TRISF_TRISF6_MASK                       0x00000040
#define _TRISF_TRISF6_LENGTH                     0x00000001

#define _TRISF_TRISF7_POSITION                   0x00000007
#define _TRISF_TRISF7_MASK                       0x00000080
#define _TRISF_TRISF7_LENGTH                     0x00000001

#define _TRISF_TRISF9_POSITION                   0x00000009
#define _TRISF_TRISF9_MASK                       0x00000200
#define _TRISF_TRISF9_LENGTH                     0x00000001

#define _TRISF_TRISF10_POSITION                  0x0000000A
#define _TRISF_TRISF10_MASK                      0x00000400
#define _TRISF_TRISF10_LENGTH                    0x00000001

#define _TRISF_TRISF12_POSITION                  0x0000000C
#define _TRISF_TRISF12_MASK                      0x00001000
#define _TRISF_TRISF12_LENGTH                    0x00000001

#define _TRISF_TRISF13_POSITION                  0x0000000D
#define _TRISF_TRISF13_MASK                      0x00002000
#define _TRISF_TRISF13_LENGTH                    0x00000001

#define _PORTF_RF0_POSITION                      0x00000000
#define _PORTF_RF0_MASK                          0x00000001
#define _PORTF_RF0_LENGTH                        0x00000001

#define _PORTF_RF1_POSITION                      0x00000001
#define _PORTF_RF1_MASK                          0x00000002
#define _PORTF_RF1_LENGTH                        0x00000001

#define _PORTF_RF4_POSITION                      0x00000004
#define _PORTF_RF4_MASK                          0x00000010
#define _PORTF_RF4_LENGTH                        0x00000001

#define _PORTF_RF5_POSITION                      0x00000005
#define _PORTF_RF5_MASK                          0x00000020
#define _PORTF_RF5_LENGTH                        0x00000001

#define _PORTF_RF6_POSITION                      0x00000006
#define _PORTF_RF6_MASK                          0x00000040
#define _PORTF_RF6_LENGTH                        0x00000001

#define _PORTF_RF7_POSITION                      0x00000007
#define _PORTF_RF7_MASK                          0x00000080
#define _PORTF_RF7_LENGTH                        0x00000001

#define _PORTF_RF9_POSITION                      0x00000009
#define _PORTF_RF9_MASK                          0x00000200
#define _PORTF_RF9_LENGTH                        0x00000001

#define _PORTF_RF10_POSITION                     0x0000000A
#define _PORTF_RF10_MASK                         0x00000400
#define _PORTF_RF10_LENGTH                       0x00000001

#define _PORTF_RF12_POSITION                     0x0000000C
#define _PORTF_RF12_MASK                         0x00001000
#define _PORTF_RF12_LENGTH                       0x00000001

#define _PORTF_RF13_POSITION                     0x0000000D
#define _PORTF_RF13_MASK                         0x00002000
#define _PORTF_RF13_LENGTH                       0x00000001

#define _LATF_LATF0_POSITION                     0x00000000
#define _LATF_LATF0_MASK                         0x00000001
#define _LATF_LATF0_LENGTH                       0x00000001

#define _LATF_LATF1_POSITION                     0x00000001
#define _LATF_LATF1_MASK                         0x00000002
#define _LATF_LATF1_LENGTH                       0x00000001

#define _LATF_LATF4_POSITION                     0x00000004
#define _LATF_LATF4_MASK                         0x00000010
#define _LATF_LATF4_LENGTH                       0x00000001

#define _LATF_LATF5_POSITION                     0x00000005
#define _LATF_LATF5_MASK                         0x00000020
#define _LATF_LATF5_LENGTH                       0x00000001

#define _LATF_LATF6_POSITION                     0x00000006
#define _LATF_LATF6_MASK                         0x00000040
#define _LATF_LATF6_LENGTH                       0x00000001

#define _LATF_LATF7_POSITION                     0x00000007
#define _LATF_LATF7_MASK                         0x00000080
#define _LATF_LATF7_LENGTH                       0x00000001

